{
    "title": "CloudStack Collaboration Conference 2025 Sessions",
    "sessions": [
      {
        "id": "H101",
        "title": "Hackathon",
        "description": "Join us for the CloudStack Collaboration Conference Hackathon on Day 1, where innovation, creativity, and collaboration come together! This event invites developers, cloud architects, system admins, and open-source enthusiasts to team up and solve real-world challenges in the cloud ecosystem using Apache CloudStack. Whether you’re a seasoned pro or new to the cloud community, this hackathon is your opportunity to dive into cutting-edge technologies, exchange ideas with fellow contributors, and push the boundaries of cloud computing.",
        "location": "Main Hall",
        "startTime": "2025-11-19T12:00:00",
        "endTime": "2025-11-19T18:00:00"
      },
      {
        "id": "S101",
        "title": "Registration and Morning Coffee",
        "description": "Registration and Morning Coffee",
        "location": "Main Hall",
        "startTime": "2025-11-20T09:00:00",
        "endTime": "2025-11-20T09:30:00"
      },
      {
        "id": "S102",
        "title": "Welcome to the CloudStack Collaboration Conference 2025",
        "description": "In this session, CloudStack PMC Member, Ivet Petrova will open the CloudStack Collaboration Conference 2025!",
        "location": "Main Hall",
        "startTime": "2025-11-20T09:30:00",
        "endTime": "2025-11-20T09:55:00"
      },
      {
        "id": "S103",
        "title": "Keynote: From Vision to Impact: Making a Difference with CloudStack",
        "description": "At last year’s CloudStack Collaboration Conference, US Signal shared why we chose Apache CloudStack as the foundation for our OpenCloud platform and our vision for what it could become. One year later, that vision has translated into tremendous growth, customer adoption, and innovation. In this keynote, US Signal’s COO, John White will reflect on the first year of building and scaling OpenCloud with CloudStack, the game-changing factors that made the difference, and the lessons learned along the way. Looking ahead, he will also share insights into the evolving open-source landscape, why CloudStack is well-positioned to lead in an evolving landscape, and how the broader community can continue to drive the next chapter of Open Cloud.",
        "location": "Main Hall",
        "startTime": "2025-11-20T09:55:00",
        "endTime": "2025-11-20T10:35:00"
      },
      {
        "id": "S104",
        "title": "Keynote: Working with CloudStack for over 10 years",
        "description": "Wido den Holander has been working with CloudStack since 2011, back when it was still known as cloud.com and had just been acquired by Citrix. Two years later, in 2013, the project found its new home at the Apache Software Foundation (ASF). Over the past decade, CloudStack has been a innovative project and proving itself as a reliable foundation for our business. In this keynote, we’ll reflect on that journey, share key milestones, and highlight how CloudStack has remained a stable pillar of our infrastructure for more than 10 years.",
        "location": "Main Hall",
        "startTime": "2025-11-20T10:50:00",
        "endTime": "2025-11-20T11:30:00"
      },
      {
        "id": "S105",
        "title": "Keynote: State of the Union",
        "description": "The Apache CloudStack project has had another exciting year – with growth in adoption, functionality and community size. In the project’s annual State of The Union talk, the current VP of the project, Nicolas Vazquez, reflects on the last year of the project’s collaboration, developments in CloudStack and community activity. He sets out how he sees the project developing over the next few years.",
        "location": "Main Hall",
        "startTime": "2025-11-20T11:40:00",
        "endTime": "2025-11-20T12:25:00"
      },
      {
        "id": "V101",
        "title": "Building a sovereign, multi-zone Cloud with CloudStack",
        "description": "CDLAN adopted CloudStack to build a truly sovereign cloud, distributed across its data centers in Milan and Rome, with a multi-zone architecture and multi-hypervisor support (KVM and VMware). Thanks to a pay-per-use model, our customers and partners can access scalable resources with no upfront costs, while benefiting from hybrid integration and simplified management. In our talk we will share how this resilient infrastructure has enabled CDLAN and our partners to accelerate the adoption of cloud services in the Italian Market.",
        "location": "Venere",
        "startTime": "2025-11-20T13:30:00",
        "endTime": "2025-11-20T14:00:00"
      },
      {
        "id": "V102",
        "title": "Infrastructure Strategies and Innovation in the AI Era",
        "description": "The rapid rise of AI, large language models, and inference workloads are driving unprecedented demand for compute resources. CloudStack operators and service providers need to leverage practical solutions and architectures to deliver services and performance to the user base.\n\nIn this session, US Signal will explore how infrastructure is evolving to meet these demands, with a focus on real-world performance metrics comparing CPU-only vs GPU-accelerated workloads and x86 vs Arm64 platforms. We’ll also examine the critical role of open-source hypervisors, GPU virtualization, time slicing, and containerized workloads on high-core hosts in maximizing utilization, improving efficiency, and reducing stranded resources.\n\nAttendees will gain insight into how these innovations converge into hybrid infrastructure models that balance performance, cost, and sustainability.\n\nBy the end of this session, participants will be able to:\n1. Evaluate the impact of AI/LLM inference workloads on infrastructure performance and global power consumption.\n2. Compare performance-per-watt across CPU-only vs GPU-accelerated systems and x86 vs Arm64 architectures.\n3. Apply concepts of open-source hypervisors, vGPU, GPU time slicing, and containers to optimize resource efficiency.\n4. Design hybrid infrastructure strategies that balance performance, cost, and sustainability for AI-era workloads.",
        "location": "Venere",
        "startTime": "2025-11-20T14:10:00",
        "endTime": "2025-11-20T14:40:00"
      },
      {
        "id": "V103",
        "title": "Exploring VMware to CloudStack Migration",
        "description": "This session offers a comprehensive business overview of migrating from VMware to CloudStack, examining impacts on services, cost management, and IT strategy to help organizations maximize their cloud investments.",
        "location": "Venere",
        "startTime": "2025-11-20T14:50:00",
        "endTime": "2025-11-20T15:20:00"
      },
      {
        "id": "V104",
        "title": "Extensions Framework (XaaS) - Enabling Orchestrate Anything",
        "description": "The Extensions Framework in Apache CloudStack enables seamless integration of external services (XaaS) into the CloudStack ecosystem. It allows operators to register and manage custom extensions, supporting a wide range of types such as orchestrators, network elements, and authenticators. This empowers users to tailor CloudStack’s behaviour to their infrastructure needs. CloudStack also ships with several inbuilt extensions, including Proxmox, Hyper-V, and Canonical MaaS, demonstrating the flexibility of the framework. For instance, a Proxmox extension can manage VM lifecycles through custom scripts, showcasing the power and adaptability of CloudStack’s extension model.",
        "location": "Venere",
        "startTime": "2025-11-20T15:30:00",
        "endTime": "2025-11-20T16:00:00"
      },
      {
        "id": "V105",
        "title": "Bringing CloudStack to Life with LLMs",
        "description": "Experience the power of AI-driven ChatOps tailored for Apache CloudStack. This modular Python-based chatbot, powered by OpenAI, enables users to ask natural language questions that translate into real-time MySQL queries, fetch logs from Elasticsearch, and deliver actionable insights, all through an intuitive web-based interface. With built-in memory, dynamic configuration, and intelligent log analysis, it redefines how Ops teams troubleshoot, monitor, and interact with cloud infrastructure. Join us to see how conversational AI can streamline your operations and accelerate problem resolution.",
        "location": "Venere",
        "startTime": "2025-11-20T16:10:00",
        "endTime": "2025-11-20T16:40:00"
      },
      {
        "id": "V106",
        "title": "Back to the Origins of the Internet: Sovereignty as Strategic Survival",
        "description": "The internet once promised decentralization. Today, a few large monoliths dominate the digital world. How did the vision of the Internet pioneers turn into a dangerous dependency? This presentation highlights how technical vendor lock-in, geopolitical risks, and the cultural imprint of AI models threaten the foundations of our digital sovereignty. We discuss how open-source technologies such as CloudStack can put power back in the hands of users to regain control over data and infrastructure. Learn why sovereignty is not just a philosophical concept, but a strategic necessity for the survival of every company.",
        "location": "Venere",
        "startTime": "2025-11-20T16:50:00",
        "endTime": "2025-11-20T17:20:00"
      },
      {
        "id": "M101",
        "title": "Customizing CloudStack Network Topology with VNF Appliances",
        "description": "The VNF appliance, introduced in Apache CloudStack 4.19, has been used by several CloudStack users as an alternative to the CloudStack Virtual Router. This talk will provide an overview of VNF appliances and showcase some real-world use cases. It will also introduce ongoing work on the VNF provider framework, which offers much better integration with VNF appliances. Topics will include technical details, the built-in VNF provider, and guidance on how to develop custom VNF providers.The VNF appliance, introduced in Apache CloudStack 4.19, has been used by several CloudStack users as an alternative to the CloudStack Virtual Router. This talk will provide an overview of VNF appliances and showcase some real-world use cases. It will also introduce ongoing work on the VNF provider framework, which offers much better integration with VNF appliances. Topics will include technical details, the built-in VNF provider, and guidance on how to develop custom VNF providers.",
        "location": "Mercurio",
        "startTime": "2025-11-20T13:30:00",
        "endTime": "2025-11-20T14:00:00"
      },
      {
        "id": "M102",
        "title": "Cost Effective, Secure Repatriation with Ampere & CloudStack",
        "description": "It’s established now that moving workloads off hyperscalers will reduce TCO, but you can offer more when dropping that onto Ampere CPU based systems through better efficiency and high utilisation. Pete Logan from Ampere describes how, using the joint architecture with CloudStack & ShapeBlue. Bonus; you can port your Graviton and other Arm workloads directly too!",
        "location": "Mercurio",
        "startTime": "2025-11-20T14:10:00",
        "endTime": "2025-11-20T14:40:00"
      },
      {
        "id": "M103",
        "title": "LINSTOR/DRBD updates for CloudStackers",
        "description": "In this session, Philipp will provide a concise introduction and overview of LINSTOR and DRBD, explaining how they offer highly available block storage to VMs in CloudStack clusters.\nFrom there, Philipp will present the recently introduced features and improvements of LINSTOR and DRBD, including a discussion of the rationale behind the changes and the next items on the project’s roadmap.\nOn the LINSTOR side, this includes: satellite restart time with thousands of resources, general scalability improvements in the range of 1,000 to 10,000 virtual volumes, and storing the master passphrase using systemd credentials (TPM chip), as well as multipathing of DRBD replication links.\nOn the DRBD side: resync without replication, higher bitmap granularity, performance optimizations, zero-copy receive, and more.\nOn the LINSTOR driver in CloudStack: thoughts on online migrating storage volume between primary storage.",
        "location": "Mercurio",
        "startTime": "2025-11-20T14:50:00",
        "endTime": "2025-11-20T15:20:00"
      },
      {
        "id": "M104",
        "title": "Migrating 1000’s of VMs from VMware to CloudStack",
        "description": "Migrating thousands of VMs from VMware to CloudStack enables companies and individuals to cut costs, escape vendor lock-in, and gain operational agility. With the right automation and phased approach, large-scale migrations can be achieved with minimal disruption. This session will explore some of the technical steps involved.",
        "location": "Mercurio",
        "startTime": "2025-11-20T15:30:00",
        "endTime": "2025-11-20T16:00:00"
      },
      {
        "id": "M105",
        "title": "KVM Storage Performance: A Comparative Analysis of I/O Modes",
        "description": "Building a high-performance, cost-effective cloud requires a deep understanding of the underlying storage infrastructure. The KVM virtualization stack offers a complex landscape of I/O technologies, from traditional iothread and aio modes to the newer, low-overhead io_uring. While these options promise different levels of performance and resource utilization, selecting the optimal configuration for a given workload can be a significant challenge for cloud builders and designers.\nThis presentation dives into a comprehensive benchmarking study designed to demystify these choices. Using industry-standard tools like FIO, pgbench, and rsync, we compare a range of KVM storage configurations across key metrics: latency, maximum IOPS, throughput, and CPU overhead. We will provide a data-driven comparison of different I/O modes—including io_uring and its predecessors—and explore how specific configurations impact performance for diverse workloads.\nJoin us to gain the practical knowledge needed to make informed design decisions for your cloud infrastructure. We will equip you with the insights to understand the trade-offs, identify performance bottlenecks, and build a KVM stack that delivers the best results for your specific needs.",
        "location": "Mercurio",
        "startTime": "2025-11-20T16:10:00",
        "endTime": "2025-11-20T16:40:00"
      },
      {
        "id": "M106",
        "title": "Where's my Instance? How CloudStack finds a suitable deployment destination",
        "description": "This session is a deep dive with examples and use cases on all deployment planners and allocation algorithms.",
        "location": "Mercurio",
        "startTime": "2025-11-20T16:50:00",
        "endTime": "2025-11-20T17:20:00"
      },
      {
        "id": "N101",
        "title": "WORKSHOP: Migration Showcase: VMware to CloudStack in Action",
        "description": "This session features a live migration of VM from VMware to CloudStack using CloudStack’s migration tool, walking through the process in real time.",
        "location": "Nettuno",
        "startTime": "2025-11-20T13:30:00",
        "endTime": "2025-11-20T14:30:00"
      },
      {
        "id": "N102",
        "title": "WORKSHOP: Measuring Storage Performance: What to Measure and How",
        "description": "Measuring storage performance is a critical skill for anyone managing modern IT infrastructure. Yet, with so many variables and tools, it’s easy to get lost or draw the wrong conclusions. This hands-on, one-hour workshop provides a practical, no-nonsense guide to storage performance benchmarking, designed for storage admins, cloud builders, and solution architects.\n\nIn this fast-paced session, you will learn the essential principles of storage performance measurement, including what key parameters to focus on and which common mistakes to avoid. We’ll dive into the most important metrics—IOPS, throughput, and latency—and show you how to read and interpret benchmark results to accurately assess system capabilities.\n\nThe core of this workshop is a practical, hands-on session where you’ll use the industry-standard tool, FIO (Flexible I/O Tester), in a provided virtual environment. You’ll walk away with the ability to:\nDesign effective benchmark tests for your specific workloads.\nExecute tests using industry-standard tools.\nAnalyze results to identify performance bottlenecks.\nMake data-driven decisions about your storage infrastructure.\nJoin us to understand storage performance and make informed choices about your systems. This is a great chance to get the skills you need to measure storage performance.\n\nPrerequisites: Participants should have a basic understanding of storage concepts and mid-level Linux administration skills. Please bring your own laptop.",
        "location": "Nettuno",
        "startTime": "2025-11-20T14:30:00",
        "endTime": "2025-11-20T15:30:00"
      },
      {
        "id": "N103",
        "title": "WORKSHOP: Bridging CloudStack With MultiCloud",
        "description": "As organizations increasingly adopt hybrid and multi-cloud strategies, CloudStack operators need practical approaches to extend their private cloud capabilities into public cloud environments.\n\nThis technical deep dive workshop demonstrates real-world integration patterns between CloudStack and major public cloud providers using Azure Arc and AWS IAM Roles Anywhere.\n\nAttendees will see live demonstrations of seamless workload deployment and resource management across CloudStack and public cloud platforms. The session provides actionable insights for building unified multi-cloud architectures that leverage CloudStack as the orchestration layer while extending capabilities into Azure and AWS environments.\nLearning Objectives\nBy the end of this session, participants will be able to:\n1. Implement Azure Arc integration with CloudStack: Learn how to register CloudStack VMs with Azure Arc, enabling centralized management, policy enforcement, and monitoring across hybrid environments.\n2. Configure AWS IAM Roles Anywhere for CloudStack workloads: Understand how to establish secure, temporary credential access for CloudStack VMs to AWS services without long-term access keys or VPN connections.\n3. Design multi-cloud orchestration patterns: Explore architectural approaches for workload distribution, data synchronization, and service integration across CloudStack and public cloud platforms.",
        "location": "Nettuno",
        "startTime": "2025-11-20T15:30:00",
        "endTime": "2025-11-20T16:30:00"
      },
      {
        "id": "H201",
        "title": "Morning Coffee",
        "description": "Morning Coffee",
        "location": "Main Hall",
        "startTime": "2025-11-21T08:30:00",
        "endTime": "2025-11-21T09:00:00"
      },
      {
        "id": "V201",
        "title": "Building OpenCloud with Apache CloudStack",
        "description": "Launching a new cloud platform is never just about technology – it’s about solving real customer challenges. In this session, US Signal’s VP of Product Development will share the journey of building OpenCloud, a high-performance, enterprise-ready platform powered by Apache CloudStack. Attendees will hear the lessons learned from design to launch, how customer feedback shaped key features, and the tangible business outcomes customers are experiencing today. The session will also provide a forward-looking view into the next wave of innovations, designed to give enterprises and service providers more flexibility, resiliency, and choice in an evolving landscape. Learning Objectives By the end of this session, participants will be able to: 1. Learn from real-world experience – Understand the challenges and best practices US Signal faced in launching OpenCloud on Apache CloudStack, like customer migrations, data protection, product documentation, and more. 2. See customer value in action – Explore how OpenCloud is helping enterprises and MSPs solve issues like cost certainty, scalability, and application performance. 3. Gain a preview of what’s next – Get insight into the roadmap and how upcoming features will continue to address evolving customer needs, such the need for virtual desktops, on-premise deployments, high performance processing for LLMS and SLMs, and more.",
        "location": "Venere",
        "startTime": "2025-11-21T09:00:00",
        "endTime": "2025-11-21T09:30:00"
      },
      {
        "id": "V202",
        "title": "2,800 VMs in 5 servers: Hyperconverged Cloud with CloudStack and StorPool",
        "description": "Traditional cloud infrastructures are complex, requiring a diverse array of components including multiple controller servers, dedicated compute hosts, dedicated storage arrays, and a complex array of network hardware. This presentation introduces a new perspective to cloud architecture. We will show how to build a fully functional, professional-grade cloud with everything you need using a highly simplified design: a minimal footprint of just 3 or 5 servers and two Ethernet switches. This optimized architecture consolidates all essential functions—a highly-available CloudStack control plane, distributed software-defined primary storage, and resilient secondary storage—onto a single, streamlined set of servers. We will explore how specific features of StorPool Storage enable this consolidation, eliminating the need for numerous specialized components and simplifying both deployment and ongoing operations. Attendees will leave with a clear understanding of how to build a cloud that is not only powerful and reliable but also dramatically easier to manage than traditional designs.",
        "location": "Venere",
        "startTime": "2025-11-21T09:30:00",
        "endTime": "2025-11-21T10:00:00"
      },
      {
        "id": "V203",
        "title": "Building India’s Sovereign Hyperscale Cloud with the CloudStack Ecosystem",
        "description": "Building India’s Sovereign Hyperscale Cloud with the CloudStack Ecosystem",
        "location": "Venere",
        "startTime": "2025-11-21T10:00:00",
        "endTime": "2025-11-21T10:30:00"
      },
      {
        "id": "V204",
        "title": "CloudStack Exploration at Cyso: Lessons Learned and Pitfalls Encountered",
        "description": "As an EU public cloud provider, Cyso sought an alternative to OpenStack. CloudStack’s capabilities appear to offer a better fit, while integration with existing suppliers has presented some intriguing challenges. Paul Bankert, CEO of Cyso Cloud, will discuss the strategic decisions, development roadmap, and ultimate objectives of this transition.",
        "location": "Venere",
        "startTime": "2025-11-21T10:50:00",
        "endTime": "2025-11-21T11:20:00"
      },
      {
        "id": "V205",
        "title": "Building Complex Scalable Networks in CloudStack. The Power of IPv6+BGP",
        "description": "With the addition of dynamic routing to CloudStack many opportunities open up for end-users to create richer and more complex network topologies with IPv6. In this talk we’ll see how end users can now create their own publicly routable networks with no operator intervention.",
        "location": "Venere",
        "startTime": "2025-11-21T11:30:00",
        "endTime": "2025-11-21T12:00:00"
      },
      {
        "id": "V206",
        "title": "AI Meets CloudStack: Simplifying Cloud Operations with StackAI",
        "description": "CloudStack is powerful, but for many users, managing cloud operations can be complex. Built by Stack Console — the white-label cloud management platform for self-provisioning and billing — StackAI acts as an intelligent support agent designed to simplify and humanize the CloudStack experience. Imagine simply typing: “Create three VMs with Ubuntu 24.04 inside a VPC, assign a public IP to one VM, and private IPs to the other two, each with 4GB RAM, 2 cores, and 50GB disk.” — and StackAI takes care of the entire process. By turning natural language into precise actions, StackAI empowers users to work faster, learn as they go, and reduces their reliance on technical support. For cloud providers, StackAI lowers support overhead, accelerates customer onboarding, and delivers a more intuitive self-service experience that boosts satisfaction. With agentic AI evolving rapidly, StackAI is shaping how CloudStack can be experienced in a more accessible, intelligent, and user-friendly way.",
        "location": "Venere",
        "startTime": "2025-11-21T12:10:00",
        "endTime": "2025-11-21T12:40:00"
      },
      {
        "id": "V207",
        "title": "Orchestrating GPU workloads with CloudStack",
        "description": "This talk dives into the technical design and implementation of native GPU orchestration in Apache CloudStack 4.21 on KVM, including device discovery, capability classification, and inventory synchronization via the KVM agent. Attendees will see how GPU‑backed service offerings are defined and consumed by Instances. We will cover operator prerequisites and host setup (IOMMU, vendor vGPU profiles), and lifecycle operations from provisioning to teardown. A live demo walks through GPU discovery on host, offering creation, and end‑to‑end deployment.",
        "location": "Venere",
        "startTime": "2025-11-21T13:40:00",
        "endTime": "2025-11-21T14:10:00"
      },
      {
        "id": "V208",
        "title": "Migrating Kubernetes Workloads from Azure to a CloudStack based Cloud",
        "description": "In this session, we’ll walk through a real-world migration of production-grade Kubernetes workloads from Microsoft Azure to an Apache CloudStack-based cloud infrastructure. You’ll learn why the migration was necessary, how it was planned and executed, and the key challenges we encountered along the way — from networking and storage differences to workload portability and automation. We’ll cover the tools and strategies used to ensure minimal downtime and high service availability, as well as lessons learned that can help guide similar cloud repatriation or cost-optimization efforts. Whether you’re considering a hybrid cloud approach or looking to regain control over your Kubernetes infrastructure, this talk will provide practical insights backed by hands-on experience.",
        "location": "Venere",
        "startTime": "2025-11-21T14:20:00",
        "endTime": "2025-11-21T14:50:00"
      },
      {
        "id": "V209",
        "title": "Escaping the Commodity Trap: From Cloud Provider to Indispensable Partner",
        "description": "In a market where Cloud offerings are increasingly commoditized, providers running on powerful platforms like Apache CloudStack have a unique opportunity to differentiate beyond price. The path to durable growth lies in leveraging CloudStack’s flexibility to elevate your role from a simple provider to a strategic partner. This session details how to achieve this transformation through deliberate innovation in your service delivery and customer support models.",
        "location": "Venere",
        "startTime": "2025-11-21T15:40:00",
        "endTime": "2025-11-21T16:10:00"
      },
      {
        "id": "V210",
        "title": "Panel Discussion and Closing: Building Sustainable IT with Open-source and Next Decade of CloudStack",
        "description": "Panel Discussion and Closing: Building Sustainable IT with Open-source and Next Decade of CloudStack",
        "location": "Venere",
        "startTime": "2025-11-21T16:20:00",
        "endTime": "2025-11-21T17:00:00"
      },
      {
        "id": "M201",
        "title": "VMware to KVM Migration Tooling in CloudStack",
        "description": "This talk will show the current state of the VMware to KVM migration tool, focusing on the improvements since the initial version and what’s next.",
        "location": "Mercurio",
        "startTime": "2025-11-21T09:00:00",
        "endTime": "2025-11-21T09:30:00"
      },
      {
        "id": "M202",
        "title": "How Scalable is CloudStack?",
        "description": "CloudStack has always known to be scalable, but just how scalable? In this talk, Boris will discuss the known and anticipated CloudStack scalability limits. He will discuss design decisions that should be made to accommodate growth and will use examples of organisations running CloudStack at massive scale.",
        "location": "Mercurio",
        "startTime": "2025-11-21T09:30:00",
        "endTime": "2025-11-21T10:00:00"
      },
      {
        "id": "M203",
        "title": "CloudStack on LinuxONE",
        "description": "IBM LinuxONE is a family of enterprise-grade Linux® servers, powered by the IBM® Telum® processor, that brings together the IBM expertise in building mission-critical systems with the openness of the Linux operating system. Combining these capabilities with the management and integration capabilities of CloudStack sounds exiting. And that’s what we have done. Now what does this mean, what have we done and what kind of benefits you can get from this combination is something you will hear in this session.",
        "location": "Mercurio",
        "startTime": "2025-11-21T10:10:00",
        "endTime": "2025-11-21T10:40:00"
      },
      {
        "id": "M204",
        "title": "Get Apache CloudStack Certified",
        "description": "Apache CloudStack Certification by ShapeBlue is the trusted certification for mastering Apache CloudStack – developed by ShapeBlue. The certification validates the knowledge for anybody working with Apache CloudStack. Covering both foundational and advanced topics, the certification demonstrates a professional’s ability to operate CloudStack effectively and it serves as proof that certified individuals possess the essential expertise to run and maintain Apache CloudStack deployments. During the CloudStack Collaboration Conference, you will have a chance to get certified and prove your CloudStack skills!",
        "location": "Mercurio",
        "startTime": "2025-11-21T10:50:00",
        "endTime": "2025-11-21T11:20:00"
      },
      {
        "id": "M205",
        "title": "Get Apache CloudStack Certified",
        "description": "Apache CloudStack Certification by ShapeBlue is the trusted certification for mastering Apache CloudStack – developed by ShapeBlue. The certification validates the knowledge for anybody working with Apache CloudStack. Covering both foundational and advanced topics, the certification demonstrates a professional’s ability to operate CloudStack effectively and it serves as proof that certified individuals possess the essential expertise to run and maintain Apache CloudStack deployments. During the CloudStack Collaboration Conference, you will have a chance to get certified and prove your CloudStack skills!",
        "location": "Mercurio",
        "startTime": "2025-11-21T11:20:00",
        "endTime": "2025-11-21T12:00:00"
      },
      {
        "id": "M206",
        "title": "Get Apache CloudStack Certified",
        "description": "Apache CloudStack Certification by ShapeBlue is the trusted certification for mastering Apache CloudStack – developed by ShapeBlue. The certification validates the knowledge for anybody working with Apache CloudStack. Covering both foundational and advanced topics, the certification demonstrates a professional’s ability to operate CloudStack effectively and it serves as proof that certified individuals possess the essential expertise to run and maintain Apache CloudStack deployments. During the CloudStack Collaboration Conference, you will have a chance to get certified and prove your CloudStack skills!",
        "location": "Mercurio",
        "startTime": "2025-11-21T12:00:00",
        "endTime": "2025-11-21T12:50:00"
      },
      {
        "id": "M207",
        "title": "Image-Based Backups with CloudStack APIs",
        "description": "US Signal customers have long relied on hypervisor-integrated, image-based backups delivered through leading enterprise data protection platforms. But as more workloads move into OpenCloud, customers asked for the same level of backup and recovery functionality, delivered natively within CloudStack. In response, US Signal partnered with CommVault to integrate image-based backup directly with CloudStack APIs. In this joint session, US Signal and CommVault will explain why this problem needed to be solved, how the integration is being built, and what the solution will look like for customers. Attendees will get a clear view into the technical architecture, API-level integration, and design considerations that make enterprise-grade data protection possible in a CloudStack-powered cloud. By the end of this session, participants will understand: • The “why”: Customer drivers behind bringing image-based backups natively into OpenCloud. • The “how”: Technical architecture and API-level integration between CloudStack and CommVault. • The “what’s next”: How this joint solution will deliver enterprise-grade protection for CloudStack workloads.",
        "location": "Mercurio",
        "startTime": "2025-11-21T13:40:00",
        "endTime": "2025-11-21T14:10:00"
      },
      {
        "id": "M208",
        "title": "Enhancements on the CloudStack Kubernetes Service",
        "description": "This talk will go through the latest enhancements on CloudStack Kubernetes Service (CKS) since 4.21 including: – Registering templates to be used for CKS nodes – Template and service offering selection per CKS node type – Possibility to separate the etcd service to dedicated CKS nodes – Add external nodes to an existing CKS cluster – CNI configuration integration with CKS cluster deployment – CSI integration",
        "location": "Mercurio",
        "startTime": "2025-11-21T14:20:00",
        "endTime": "2025-11-21T14:50:00"
      },
      {
        "id": "M209",
        "title": "Cloudstack-related Infrastructure Monitoring using Grafana Stack",
        "description": "Monitoring is critical for running a reliable and performant cloud environment. Apache CloudStack provides rich APIs and metrics, but turning this data into actionable insights requires a modern observability stack. In this session, we will demonstrate how to build a complete monitoring solution for CloudStack using Prometheus, Alertmanager, and Grafana – the Grafana stack. We’ll walk through the architecture for collecting and visualizing CloudStack metrics, including: - Configuring Prometheus to scrape CloudStack metrics (via API or exporters). - Tracking VM, host, storage, and network utilization. - Building intuitive Grafana dashboards for operators and tenants. - Setting up automated alerts for capacity thresholds and failures. - Attendees will also gain insights into key advantages of this approach: - Unified Visibility: Single-pane-of-glass view for CloudStack management servers, hypervisors, and system VMs. - Proactive Operations: Early detection of capacity bottlenecks, API latency, and infrastructure anomalies. - Scalability: Easily extend monitoring as CloudStack regions/zones grow. - Automation-Friendly: Integrate alerts with ticketing systems or autoscaling workflows. - Open & Flexible: Fully open-source, customizable dashboards with support for long-term metric retention.",
        "location": "Mercurio",
        "startTime": "2025-11-21T15:00:00",
        "endTime": "2025-11-21T15:30:00"
      },
      {
        "id": "M210",
        "title": "Issues, Pull Requests, Mailing Lists, Oh My: Gaining Clarity in an Open Source Support Model",
        "description": "As many organizations look to take control of their infrastructure by moving from closed source platforms to open source, the transition to getting support and contributing to projects is not always abundantly clear. Learn from US Signal’s experience moving from traditional enterprise platforms to open source. The presentation aims to provide a translation guide to help shift the mindset for engineers and leaders alike who are dipping their feet into Apache CloudStack.As many organizations look to take control of their infrastructure by moving from closed source platforms to open source, the transition to getting support and contributing to projects is not always abundantly clear. Learn from US Signal’s experience moving from traditional enterprise platforms to open source. The presentation aims to provide a translation guide to help shift the mindset for engineers and leaders alike who are dipping their feet into Apache CloudStack.",
        "location": "Mercurio",
        "startTime": "2025-11-21T15:40:00",
        "endTime": "2025-11-21T16:10:00"
      },
      {
        "id": "N201",
        "title": "DEMO: Revolutionising CloudStack Networking with Netris Integration",
        "description": "TLDR; Automating networks and routing in CloudStack with Netris. Transform your cloud infrastructure management. Join Cyso Cloud for an insightful technical presentation exploring how the powerful combination of Netris and CloudStack is helping us automate key parts of our network setup. This session will reveal how Netris integration solves real-world networking challenges that traditional CloudStack deployments face.What you’ll learn: What we have used, why we’re using Netris and what we’re looking to get out of it. How Netris simplifies our network management, see how Netris consolidates network infrastructure into a single management point, eliminating the complexity of managing multiple networking tools and interfaces. A live demonstration of a CloudStack zone with Netris automated networking. A look to the future and the key issues we hope it tackles. Who should attend: Infrastructure architects, network engineers, CloudStack administrators, and DevOps teams evaluating modern cloud platform alternatives. Perfect for organizations seeking to enhance their CloudStack environments or those considering migration from traditional virtualization platforms.",
        "location": "Nettuno",
        "startTime": "2025-11-21T09:00:00",
        "endTime": "2025-11-21T10:30:00"
      },
      {
        "id": "N202",
        "title": "WORKSHOP: Setup Linstor SDS and CloudStack",
        "description": "A guided step by step guide on how to setup Linstor SDS and CloudStack in a HA setup. We will start from freshly installed virtual machines and show you how to install Linstor within a HA setup and afterwards configure CloudStack with it. Afterwards we will run some live migration and failover tests.",
        "location": "Nettuno",
        "startTime": "2025-11-21T10:30:00",
        "endTime": "2025-11-21T11:30:00"
      },
      {
        "id": "H202",
        "title": "Lunch Break",
        "description": "Lunch Break",
        "location": "Main Hall",
        "startTime": "2025-11-21T12:40:00",
        "endTime": "2025-11-21T13:40:00"
      }
    ]
  }
